results/data/run4/jvm-static/erik-laptop/quarkus-io-thread-110000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/greeting/Bob
  4 threads and 100 connections
  Thread calibration: mean lat.: 2.683ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 2.676ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 2.911ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 2.556ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.97ms    5.49ms  45.12ms   85.59%
    Req/Sec    28.63k    10.12k   81.00k    76.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.65ms
 75.000%    3.14ms
 90.000%   12.74ms
 99.000%   23.60ms
 99.900%   30.69ms
 99.990%   38.81ms
 99.999%   42.21ms
100.000%   45.15ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.109     0.000000            1         1.00
       0.578     0.100000       549221         1.11
       0.868     0.200000      1098202         1.25
       1.126     0.300000      1646463         1.43
       1.375     0.400000      2194818         1.67
       1.647     0.500000      2744125         2.00
       1.800     0.550000      3017967         2.22
       1.979     0.600000      3290911         2.50
       2.201     0.650000      3565107         2.86
       2.505     0.700000      3840630         3.33
       3.143     0.750000      4113725         4.00
       4.243     0.775000      4250694         4.44
       5.783     0.800000      4388089         5.00
       7.391     0.825000      4524994         5.71
       9.055     0.850000      4662152         6.67
      10.831     0.875000      4799356         8.00
      11.767     0.887500      4868103         8.89
      12.743     0.900000      4936761        10.00
      13.767     0.912500      5004995        11.43
      14.863     0.925000      5073637        13.33
      16.047     0.937500      5142159        16.00
      16.687     0.943750      5177091        17.78
      17.343     0.950000      5210750        20.00
      18.047     0.956250      5245112        22.86
      18.799     0.962500      5279384        26.67
      19.615     0.968750      5313556        32.00
      20.063     0.971875      5330882        35.56
      20.527     0.975000      5347739        40.00
      21.039     0.978125      5364884        45.71
      21.599     0.981250      5382033        53.33
      22.223     0.984375      5399400        64.00
      22.559     0.985938      5407892        71.11
      22.927     0.987500      5416383        80.00
      23.343     0.989062      5425024        91.43
      23.791     0.990625      5433344       106.67
      24.319     0.992188      5441923       128.00
      24.623     0.992969      5446342       142.22
      24.959     0.993750      5450638       160.00
      25.327     0.994531      5454864       182.86
      25.759     0.995313      5459174       213.33
      26.255     0.996094      5463379       256.00
      26.543     0.996484      5465470       284.44
      26.879     0.996875      5467656       320.00
      27.247     0.997266      5469757       365.71
      27.711     0.997656      5471927       426.67
      28.255     0.998047      5474041       512.00
      28.575     0.998242      5475103       568.89
      28.943     0.998437      5476172       640.00
      29.407     0.998633      5477255       731.43
      29.999     0.998828      5478322       853.33
      30.783     0.999023      5479380      1024.00
      31.295     0.999121      5479916      1137.78
      31.855     0.999219      5480452      1280.00
      32.447     0.999316      5480984      1462.86
      33.183     0.999414      5481530      1706.67
      33.951     0.999512      5482060      2048.00
      34.431     0.999561      5482328      2275.56
      34.911     0.999609      5482607      2560.00
      35.327     0.999658      5482860      2925.71
      35.807     0.999707      5483126      3413.33
      36.383     0.999756      5483394      4096.00
      36.735     0.999780      5483530      4551.11
      37.119     0.999805      5483669      5120.00
      37.471     0.999829      5483793      5851.43
      37.919     0.999854      5483938      6826.67
      38.335     0.999878      5484059      8192.00
      38.591     0.999890      5484127      9102.22
      38.847     0.999902      5484193     10240.00
      39.103     0.999915      5484269     11702.86
      39.391     0.999927      5484335     13653.33
      39.647     0.999939      5484395     16384.00
      39.839     0.999945      5484427     18204.44
      40.031     0.999951      5484466     20480.00
      40.255     0.999957      5484494     23405.71
      40.447     0.999963      5484528     27306.67
      40.735     0.999969      5484561     32768.00
      40.895     0.999973      5484577     36408.89
      41.119     0.999976      5484595     40960.00
      41.311     0.999979      5484610     46811.43
      41.599     0.999982      5484628     54613.33
      41.823     0.999985      5484647     65536.00
      41.919     0.999986      5484653     72817.78
      42.079     0.999988      5484663     81920.00
      42.175     0.999989      5484671     93622.86
      42.367     0.999991      5484678    109226.67
      42.559     0.999992      5484686    131072.00
      42.751     0.999993      5484690    145635.56
      42.879     0.999994      5484695    163840.00
      42.975     0.999995      5484698    187245.71
      43.135     0.999995      5484702    218453.33
      43.487     0.999996      5484708    262144.00
      43.615     0.999997      5484709    291271.11
      43.839     0.999997      5484711    327680.00
      43.935     0.999997      5484713    374491.43
      44.191     0.999998      5484715    436906.67
      44.223     0.999998      5484717    524288.00
      44.255     0.999998      5484718    582542.22
      44.319     0.999998      5484719    655360.00
      44.447     0.999999      5484720    748982.86
      44.543     0.999999      5484721    873813.33
      44.607     0.999999      5484722   1048576.00
      44.767     0.999999      5484723   1165084.44
      44.767     0.999999      5484723   1310720.00
      44.831     0.999999      5484724   1497965.71
      44.831     0.999999      5484724   1747626.67
      44.895     1.000000      5484725   2097152.00
      44.895     1.000000      5484725   2330168.89
      44.895     1.000000      5484725   2621440.00
      44.959     1.000000      5484726   2995931.43
      44.959     1.000000      5484726   3495253.33
      44.959     1.000000      5484726   4194304.00
      44.959     1.000000      5484726   4660337.78
      44.959     1.000000      5484726   5242880.00
      45.151     1.000000      5484727   5991862.86
      45.151     1.000000      5484727          inf
#[Mean    =        3.968, StdDeviation   =        5.495]
#[Max     =       45.120, Total count    =      5484727]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6591748 requests in 1.00m, 458.91MB read
Requests/sec: 109839.95
Transfer/sec:      7.65MB