results/data/run4/jvm-static/erik-laptop/quarkus-io-thread-120000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/greeting/Bob
  4 threads and 100 connections
  Thread calibration: mean lat.: 9.932ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 10.240ms, rate sampling interval: 48ms
  Thread calibration: mean lat.: 10.266ms, rate sampling interval: 48ms
  Thread calibration: mean lat.: 10.013ms, rate sampling interval: 47ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.56ms   10.41ms  75.84ms   54.38%
    Req/Sec    30.32k    11.50k   70.21k    56.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.08ms
 75.000%   20.88ms
 90.000%   27.57ms
 99.000%   35.74ms
 99.900%   47.84ms
 99.990%   64.19ms
 99.999%   72.19ms
100.000%   75.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.106     0.000000            1         1.00
       0.932     0.100000       599239         1.11
       1.581     0.200000      1198241         1.25
       2.957     0.300000      1796710         1.43
       7.043     0.400000      2395343         1.67
      11.079     0.500000      2995159         2.00
      13.039     0.550000      3294187         2.22
      14.983     0.600000      3593885         2.50
      16.927     0.650000      3892626         2.86
      18.895     0.700000      4193974         3.33
      20.879     0.750000      4493366         4.00
      21.887     0.775000      4641428         4.44
      22.943     0.800000      4792175         5.00
      24.015     0.825000      4940616         5.71
      25.135     0.850000      5090962         6.67
      26.303     0.875000      5240636         8.00
      26.911     0.887500      5314569         8.89
      27.567     0.900000      5390938        10.00
      28.239     0.912500      5464883        11.43
      28.959     0.925000      5539727        13.33
      29.743     0.937500      5614958        16.00
      30.159     0.943750      5651590        17.78
      30.623     0.950000      5689956        20.00
      31.103     0.956250      5726237        22.86
      31.647     0.962500      5763938        26.67
      32.255     0.968750      5801362        32.00
      32.591     0.971875      5819843        35.56
      32.959     0.975000      5838699        40.00
      33.375     0.978125      5858012        45.71
      33.823     0.981250      5876211        53.33
      34.367     0.984375      5894827        64.00
      34.687     0.985938      5904394        71.11
      35.039     0.987500      5913702        80.00
      35.455     0.989062      5923058        91.43
      35.935     0.990625      5932268       106.67
      36.511     0.992188      5941350       128.00
      36.895     0.992969      5946321       142.22
      37.311     0.993750      5950834       160.00
      37.823     0.994531      5955559       182.86
      38.431     0.995313      5960256       213.33
      39.167     0.996094      5964816       256.00
      39.647     0.996484      5967211       284.44
      40.191     0.996875      5969455       320.00
      40.863     0.997266      5971811       365.71
      41.663     0.997656      5974102       426.67
      42.719     0.998047      5976457       512.00
      43.359     0.998242      5977624       568.89
      44.159     0.998437      5978795       640.00
      45.151     0.998633      5979958       731.43
      46.431     0.998828      5981122       853.33
      48.031     0.999023      5982284      1024.00
      48.991     0.999121      5982870      1137.78
      50.015     0.999219      5983453      1280.00
      51.199     0.999316      5984048      1462.86
      52.511     0.999414      5984630      1706.67
      53.919     0.999512      5985207      2048.00
      54.719     0.999561      5985500      2275.56
      55.551     0.999609      5985794      2560.00
      56.383     0.999658      5986087      2925.71
      57.247     0.999707      5986372      3413.33
      58.271     0.999756      5986671      4096.00
      58.783     0.999780      5986812      4551.11
      59.455     0.999805      5986959      5120.00
      60.191     0.999829      5987108      5851.43
      61.119     0.999854      5987247      6826.67
      62.623     0.999878      5987397      8192.00
      63.519     0.999890      5987467      9102.22
      64.383     0.999902      5987540     10240.00
      65.247     0.999915      5987613     11702.86
      66.111     0.999927      5987685     13653.33
      67.007     0.999939      5987760     16384.00
      67.455     0.999945      5987798     18204.44
      67.967     0.999951      5987834     20480.00
      68.415     0.999957      5987869     23405.71
      68.991     0.999963      5987909     27306.67
      69.567     0.999969      5987944     32768.00
      69.823     0.999973      5987959     36408.89
      70.143     0.999976      5987980     40960.00
      70.527     0.999979      5987997     46811.43
      70.847     0.999982      5988015     54613.33
      71.423     0.999985      5988036     65536.00
      71.615     0.999986      5988041     72817.78
      71.871     0.999988      5988051     81920.00
      72.127     0.999989      5988062     93622.86
      72.383     0.999991      5988070    109226.67
      72.703     0.999992      5988078    131072.00
      72.895     0.999993      5988083    145635.56
      73.151     0.999994      5988087    163840.00
      73.471     0.999995      5988093    187245.71
      73.727     0.999995      5988097    218453.33
      73.919     0.999996      5988101    262144.00
      73.983     0.999997      5988104    291271.11
      74.047     0.999997      5988105    327680.00
      74.431     0.999997      5988108    374491.43
      74.623     0.999998      5988110    436906.67
      74.943     0.999998      5988112    524288.00
      75.007     0.999998      5988113    582542.22
      75.135     0.999998      5988114    655360.00
      75.327     0.999999      5988116    748982.86
      75.391     0.999999      5988117    873813.33
      75.583     0.999999      5988120   1048576.00
      75.583     0.999999      5988120   1165084.44
      75.583     0.999999      5988120   1310720.00
      75.583     0.999999      5988120   1497965.71
      75.583     0.999999      5988120   1747626.67
      75.775     1.000000      5988121   2097152.00
      75.775     1.000000      5988121   2330168.89
      75.775     1.000000      5988121   2621440.00
      75.839     1.000000      5988122   2995931.43
      75.839     1.000000      5988122   3495253.33
      75.839     1.000000      5988122   4194304.00
      75.839     1.000000      5988122   4660337.78
      75.839     1.000000      5988122   5242880.00
      75.903     1.000000      5988123   5991862.86
      75.903     1.000000      5988123          inf
#[Mean    =       12.558, StdDeviation   =       10.407]
#[Max     =       75.840, Total count    =      5988123]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7192621 requests in 1.00m, 500.74MB read
Requests/sec: 119877.23
Transfer/sec:      8.35MB