results/data/run4/jvm-static/erik-laptop/quarkus-io-thread-60000-WARM-UP.wrk2.out
Running 1m test @ http://erik-pc.local:8080/greeting/Bob
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.169ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.170ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.164ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.174ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.16ms  514.00us   4.47ms   63.86%
    Req/Sec    15.81k     1.04k   19.78k    73.92%
  3596361 requests in 1.00m, 250.37MB read
Requests/sec:  59939.21
Transfer/sec:      4.17MB